{
  "archetypes": [
    {
      "name": "Limits to Growth (Limits to Success)",
      "rationale": "The model shows a reinforcing loop where Project Reputation drives Joining Rate, which increases Core Developers and improves PR Feedback, further enhancing reputation. However, this growth is limited by balancing loops: Core Developer turnover and capacity constraints create PR Review Delay, which negatively affects PR Feedback and Community Health, ultimately constraining further growth. This matches the classic Limits to Growth archetype where accelerating growth encounters limiting factors.",
      "additions": {
        "variables": [
          {
            "name": "Growth Pressure",
            "type": "Auxiliary",
            "description": "The pressure to maintain growth momentum as reputation and user base increase",
            "rationale": "Needed to represent the driving force that exacerbates the limiting factors"
          },
          {
            "name": "Capacity Constraint",
            "type": "Auxiliary",
            "description": "The maximum sustainable workload that core developers can handle effectively",
            "rationale": "Needed to explicitly represent the limiting factor that creates the balancing loop"
          }
        ],
        "connections": [
          {
            "from": "Project Reputation",
            "to": "Growth Pressure",
            "relationship": "positive",
            "rationale": "Higher reputation creates more pressure to maintain growth and performance"
          },
          {
            "from": "Growth Pressure",
            "to": "PR Review Delay",
            "relationship": "positive",
            "rationale": "Growth pressure increases workload on core developers, worsening review delays"
          },
          {
            "from": "Core Developer",
            "to": "Capacity Constraint",
            "relationship": "positive",
            "rationale": "More core developers increase the team's capacity to handle workload"
          },
          {
            "from": "Capacity Constraint",
            "to": "PR Review Delay",
            "relationship": "negative",
            "rationale": "Higher capacity reduces review delays, completing the balancing loop"
          }
        ]
      },
      "modifications": {
        "variables": []
      },
      "removals": {
        "variables": []
      }
    },
    {
      "name": "Shifting the Burden",
      "rationale": "The model shows potential for shifting burden from long-term capacity building to short-term fixes. Core developers may focus on immediate PR reviews (short-term solution) rather than mentoring and knowledge transfer (fundamental solution). This is evidenced by the tension between PR Review Delay driving immediate action versus Implicit Knowledge Transfer building long-term capacity. The archetype fits because short-term fixes can undermine long-term capability development.",
      "additions": {
        "variables": [
          {
            "name": "Short Term Fix Pressure",
            "type": "Auxiliary",
            "description": "Pressure to address immediate problems like PR backlog rather than long-term capacity building",
            "rationale": "Needed to represent the driving force for shifting to symptomatic solutions"
          },
          {
            "name": "Long Term Capacity Building",
            "type": "Flow",
            "description": "Investment in mentoring, documentation, and knowledge transfer activities",
            "rationale": "Needed to explicitly represent the fundamental solution that gets neglected"
          }
        ],
        "connections": [
          {
            "from": "PR Review Delay",
            "to": "Short Term Fix Pressure",
            "relationship": "positive",
            "rationale": "Long review delays create pressure for immediate action"
          },
          {
            "from": "Short Term Fix Pressure",
            "to": "Long Term Capacity Building",
            "relationship": "negative",
            "rationale": "Pressure for short-term fixes reduces investment in long-term capacity building"
          },
          {
            "from": "Long Term Capacity Building",
            "to": "Core Developer",
            "relationship": "positive",
            "rationale": "Capacity building increases the number of effective core developers over time"
          },
          {
            "from": "Long Term Capacity Building",
            "to": "Implicit Knowledge Transfer (Mentorship)",
            "relationship": "positive",
            "rationale": "Capacity building activities enhance knowledge transfer effectiveness"
          }
        ]
      },
      "modifications": {
        "variables": []
      },
      "removals": {
        "variables": []
      }
    },
    {
      "name": "Tragedy of the Commons",
      "rationale": "The model shows multiple user groups (New Contributors, Experienced Contributors, Core Developers) all drawing on the shared resource of Core Developer time for PR reviews and mentoring. As more contributors join and create pull requests, they collectively overload the limited Core Developer capacity, leading to PR Review Delay that negatively affects everyone. This matches the Tragedy of the Commons pattern where individual benefits conflict with collective resource depletion.",
      "additions": {
        "variables": [
          {
            "name": "Shared Resource Depletion",
            "type": "Auxiliary",
            "description": "The degree to which core developer time and attention is being overutilized",
            "rationale": "Needed to represent the depletion of the shared resource that affects all participants"
          },
          {
            "name": "Individual Benefit Perception",
            "type": "Auxiliary",
            "description": "Perceived benefit to individual contributors from submitting more PRs or issues",
            "rationale": "Needed to represent the driving force for individual actions that deplete shared resources"
          }
        ],
        "connections": [
          {
            "from": "New Contributors",
            "to": "Shared Resource Depletion",
            "relationship": "positive",
            "rationale": "More contributors increase demand on the shared core developer resource"
          },
          {
            "from": "Experienced Contributors",
            "to": "Shared Resource Depletion",
            "relationship": "positive",
            "rationale": "Experienced contributors also consume core developer time for complex reviews"
          },
          {
            "from": "New Pull request",
            "to": "Shared Resource Depletion",
            "relationship": "positive",
            "rationale": "More pull requests increase the workload on the shared resource"
          },
          {
            "from": "Shared Resource Depletion",
            "to": "PR Review Delay",
            "relationship": "positive",
            "rationale": "Resource depletion directly causes longer review delays for everyone"
          },
          {
            "from": "Project Reputation",
            "to": "Individual Benefit Perception",
            "relationship": "positive",
            "rationale": "Higher reputation increases perceived benefits of participation"
          },
          {
            "from": "Individual Benefit Perception",
            "to": "New Pr rate",
            "relationship": "positive",
            "rationale": "Higher perceived benefits drive more individual contribution activity"
          }
        ]
      },
      "modifications": {
        "variables": []
      },
      "removals": {
        "variables": []
      }
    }
  ]
}