{
  "theory_decisions": [
    {
      "theory_name": "Communities of Practice (Wenger)",
      "decision": "include"
    },
    {
      "theory_name": "Nonaka's SECI Model",
      "decision": "include"
    },
    {
      "theory_name": "The Coevolution of New Organizational Forms",
      "decision": "include"
    },
    {
      "theory_name": "Adaptive Structuration Theory",
      "decision": "include"
    },
    {
      "theory_name": "Stability and Change in Organizational Routines",
      "decision": "include"
    },
    {
      "theory_name": "A Dynamic Theory of Organizational Knowledge Creation",
      "decision": "include"
    },
    {
      "theory_name": "Routines and Transactive Memory Systems",
      "decision": "include"
    },
    {
      "theory_name": "Communities of Practice",
      "decision": "include"
    },
    {
      "theory_name": "Punctuated Equilibrium Theory in IS Research",
      "decision": "include"
    },
    {
      "theory_name": "Panarchy Theory",
      "decision": "include"
    },
    {
      "theory_name": "Legitimate Peripheral Participation",
      "decision": "include"
    },
    {
      "theory_name": "Absorptive Capacity",
      "decision": "include"
    },
    {
      "theory_name": "Diversity Trumps Ability",
      "decision": "include"
    },
    {
      "theory_name": "Hidden Order: How Adaptation Builds Complexity",
      "decision": "include"
    },
    {
      "theory_name": "Social Cognitive Career Theory (SCCT)",
      "decision": "include"
    },
    {
      "theory_name": "Diffusion of Innovations",
      "decision": "include"
    },
    {
      "theory_name": "Task-Technology Fit (TTF)",
      "decision": "include"
    },
    {
      "theory_name": "Skill-Biased Technical Change",
      "decision": "include"
    },
    {
      "theory_name": "Social Capital and Structural Holes",
      "decision": "include"
    },
    {
      "theory_name": "Signaling Theory",
      "decision": "include"
    },
    {
      "theory_name": "Job Demands-Resources (JD-R) Model",
      "decision": "include"
    }
  ],
  "clustering_strategy": {
    "clusters": [
      {
        "name": "Attraction and Conversion to Engagement",
        "narrative": "A stock of Prospective Observers accumulates as developers become aware of the project through search, social mentions, and ecosystem channels. Their inflow is driven by project visibility, endorsements, and perceived legitimacy; their outflow is churn back to the general developer pool when interest fades. A conversion flow moves Prospective Observers into Engaged Newcomers when perceived benefits outweigh perceived costs. Benefits are signaled by stars, badges, release stability, and responsive governance; costs are estimated onboarding time, uncertainty about norms, and expected review latency. Conversion accelerates when the project’s signals are credible (Signaling Theory) and when newcomers see peers like themselves participating (Communities of Practice identity cues, SCCT outcome expectations and self-efficacy). Diversity of entry points (documentation, design, localization, triage) increases the probability that at least one pathway fits a newcomer’s skills and preferences, increasing conversion elasticity (Diversity Trumps Ability). Diffusion of Innovations governs the movement from awareness to interest; early adopters’ endorsements propagate through networks, with a 2–8 week delay before visible surges. A reinforcing loop operates as Engaged Newcomers produce social proof (issues, discussions), which raises perceived legitimacy and boosts future inflow. A balancing loop emerges when anticipated response time exceeds a tacit threshold (e.g., PRs sit >7–10 days), depressing conversion. Nonlinearity appears as a social-proof threshold: below visible sustained activity, conversion remains low; once activity crosses a perceptual threshold, conversion rises sharply. Time-to-conversion typically ranges from days to a few weeks; spikes occur after major releases or positive press with a 1–2 week lag.",
        "theories_used": [
          "Diffusion of Innovations",
          "Signaling Theory",
          "Social Cognitive Career Theory (SCCT)",
          "Communities of Practice (Wenger)",
          "Communities of Practice",
          "Diversity Trumps Ability"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Legitimate Peripheral Socialization",
            "connection_type": "feeds_into",
            "description": "Engaged Newcomers flow into the peripheral socialization stage."
          },
          {
            "target_cluster": "Governance Capacity, Routine Evolution, and Project Reputation",
            "connection_type": "feedback_loop",
            "description": "Project reputation and release credibility increase the arrival rate of Prospective Observers and the conversion fraction to Engaged Newcomers."
          }
        ]
      },
      {
        "name": "Legitimate Peripheral Socialization",
        "narrative": "Engaged Newcomers accumulate as individuals who have signaled interest and begun observing or asking questions. They transition to Peripheral Participants by taking low-risk, legitimate tasks (e.g., clarifying docs, tagging issues) at a rate limited by access to legitimate opportunities and socialization bandwidth. Legitimate Peripheral Participation explains that newcomers learn norms and practice by participating at the edge, with practice-based identity building as they observe and mimic. Communities of Practice dynamics provide a reinforcing loop: as Peripheral Participants grow, more peer help and examples become available, which lowers the perceived risk of first actions and increases progression speed. However, mentoring capacity and clarity of contribution rules create a balancing loop. When the volume of Engaged Newcomers exceeds available response bandwidth, questions go unanswered, increasing time-to-first-response; progression slows and some revert to inactivity. SCCT mechanisms operate as successful micro-actions (merged typo fixes, answered questions) raise self-efficacy, increasing the hazard rate of transitioning to more complex tasks. Task-technology friction (setup pain, unclear issue templates) shows up as nonlinearity: below a minimum effective documentation clarity (e.g., up-to-date setup scripts), progression is very slow; above it, transition rates increase sharply. Delays of 1–4 weeks are typical between initial engagement and first peripheral acts; seasonal effects arise around major releases. Adaptive social norms and mentoring behaviors are appropriated and reinforced over time, with drift toward inclusivity when feedback loops highlight that gentle guidance increases retention.",
        "theories_used": [
          "Legitimate Peripheral Participation",
          "Communities of Practice (Wenger)",
          "Communities of Practice",
          "Social Cognitive Career Theory (SCCT)",
          "Task-Technology Fit (TTF)"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Task-Fit Onboarding and First Contribution",
            "connection_type": "feeds_into",
            "description": "Peripheral Participants become ready to attempt their first substantial contribution."
          },
          {
            "target_cluster": "Maintainer Workload, Support, and Retention",
            "connection_type": "feedback_loop",
            "description": "Mentoring and response bandwidth from maintainers modulates progression rates through socialization."
          }
        ]
      },
      {
        "name": "Task-Fit Onboarding and First Contribution",
        "narrative": "Peripheral Participants accumulate as individuals who have completed small, low-risk actions and internalized basic norms. They advance to Active PR Submitters via a First-PR rate determined by task-technology fit, review capacity, and clarity of processes. Task-Technology Fit governs productivity: if local environment setup, CI, and linters align well with the newcomer’s OS, language version, and IDE, the cycle time to first working change shortens; poor fit creates friction and abandonment. SECI processes translate tacit heuristics embedded in templates and exemplars into explicit steps (externalization), which newcomers then recombine to craft their first contributions (combination). Adaptive Structuration Theory explains how contributors appropriate tooling (issue templates, PR bots) and rules (style checks) as resources to accomplish tasks; consistent appropriation reduces variance in PR quality, increasing acceptance probability. A reinforcing loop occurs when the stock of accepted first contributions grows: newcomers see a shorter and more predictable review queue, which boosts attempt rates. A balancing loop is the review backlog: if PR queue length or time-to-first-review exceeds a threshold (e.g., >5 business days), first-PR attempts slow, and abandonment increases. Nonlinearities arise at two thresholds: setup friction (below which virtually no first PRs complete) and review latency (beyond which abandonment accelerates). Typical delays include 1–3 days for environment setup and 1–2 weeks from submission to merge. Hidden Order suggests that local, incremental improvements (e.g., better templates) can produce disproportionate gains in throughput by aligning micro-rules with emergent work patterns.",
        "theories_used": [
          "Task-Technology Fit (TTF)",
          "Nonaka's SECI Model",
          "A Dynamic Theory of Organizational Knowledge Creation",
          "Adaptive Structuration Theory",
          "Diffusion of Innovations",
          "Hidden Order: How Adaptation Builds Complexity"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Knowledge Internalization and Architectural Understanding",
            "connection_type": "feeds_into",
            "description": "Active PR Submitters move on to deepen codebase understanding through repeated contribution cycles."
          },
          {
            "target_cluster": "Maintainer Workload, Support, and Retention",
            "connection_type": "feedback_loop",
            "description": "Review throughput and feedback quality from maintainers shape first-PR acceptance probability and cycle time."
          },
          {
            "target_cluster": "Governance Capacity, Routine Evolution, and Project Reputation",
            "connection_type": "feedback_loop",
            "description": "Clarity and stability of contribution routines, automation, and release cadence affect first-PR completion and acceptance rates."
          }
        ]
      },
      {
        "name": "Knowledge Internalization and Architectural Understanding",
        "narrative": "Active PR Submitters accumulate as individuals with at least one substantive PR experience. They become Competent Contributors when they internalize architectural patterns, module boundaries, and review heuristics, enabling faster, higher-quality contributions with less guidance. Absorptive Capacity governs this transition: prior related knowledge (language, framework) and the frequency of meaningful interactions with the code and reviewers jointly determine the learning rate. SECI processes continue as tacit reviewer heuristics are internalized through repeated feedback, and contributors begin to combine multiple modules’ practices to produce more integrated changes. Transactive Memory Systems emerge as contributors learn who knows what and how to route questions; this reduces search costs and increases effective problem-solving capacity. A reinforcing learning curve operates: as competence increases, cycle time drops, enabling more contribution episodes per unit time, which further deepens architectural understanding. A balancing loop arises from codebase complexity and volatility; as the project adopts new paradigms or refactors, the gap between current mental models and code reality widens, temporarily slowing progression. Skill-Biased Technical Change can raise the bar for competence when the project adopts more sophisticated tooling or languages, stretching time to competence for some. Typical delays are 3–9 months from first PR to stable competence, with nonlinear acceleration after crossing a threshold of roughly several dozen contributions or successful reviews in diverse modules. When review feedback becomes sparse (e.g., during maintainer overload), the learning loop weakens, slowing transitions despite ongoing activity.",
        "theories_used": [
          "Absorptive Capacity",
          "Nonaka's SECI Model",
          "A Dynamic Theory of Organizational Knowledge Creation",
          "Routines and Transactive Memory Systems",
          "Skill-Biased Technical Change"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Reputation Accumulation and Social Capital",
            "connection_type": "feeds_into",
            "description": "Competent Contributors begin to accrue visible signals and ties that translate competence into trust."
          }
        ]
      },
      {
        "name": "Reputation Accumulation and Social Capital",
        "narrative": "Competent Contributors accumulate and begin to convert performance into trust by building recognizable signals and brokerage ties. They transition into Recognized Contributors when their visible track record, reliability, and network position cross community thresholds. Signaling operates through accepted PR ratios, turnaround time, issue triage quality, release-related tasks, and constructive review comments. Social Capital and Structural Holes highlight that contributors who bridge sub-teams or modules gain disproportionate reputational returns by reducing coordination costs and connecting knowledge islands. A reinforcing loop emerges: as recognition grows, contributors are invited to review and triage, further increasing visibility and accelerating recognition. A balancing loop comes from recognition bandwidth—maintainers have limited attention to confer trust, and signal noise (e.g., low-impact PR volume) can dilute perceived quality, slowing recognition. Communities of Practice dynamics matter: alignment with core norms and identity signals accelerates trust formation, while perceived norm violations (even if technically competent) slow it. Diversity Trumps Ability suggests that heterogeneity in the recognition pool can improve problem-solving and resilience, prompting governance to diversify recognition criteria, which can lower hidden barriers and enhance throughput. Nonlinearities include threshold effects: after a few high-salience contributions (e.g., fixing a critical bug), perceived trust can jump discretely. Typical lags are 2–6 months from competence to recognition, with faster paths when review scarcity allows competent contributors to fill gaps, amplifying their visibility.",
        "theories_used": [
          "Signaling Theory",
          "Social Capital and Structural Holes",
          "Communities of Practice (Wenger)",
          "Communities of Practice",
          "Diversity Trumps Ability"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Role Expansion into Governance Work",
            "connection_type": "feeds_into",
            "description": "Recognized Contributors are given or volunteer for governance-adjacent responsibilities (triage, reviews, release chores)."
          }
        ]
      },
      {
        "name": "Role Expansion into Governance Work",
        "narrative": "Recognized Contributors accumulate as trusted actors and begin appropriating governance-related tasks—issue triage, moderation, release preparation, and policy discussions. They transition to Maintainer Candidates when they demonstrate sustained reliability in these roles and appropriate project rules effectively. Adaptive Structuration Theory explains how contributors appropriate rules and resources (e.g., label taxonomies, CODEOWNERS, voting procedures). Effective appropriation both follows and shapes local norms; recurring successful appropriations crystallize into routines (Stability and Change in Organizational Routines). Ostrom-inspired governance principles (monitoring, graduated sanctions, collective-choice arrangements) help maintain rule credibility: consistent enforcement and transparent deliberation increase candidates’ willingness to invest in governance work. A reinforcing loop: more contributors taking on triage/review reduces maintainer workload and PR latency, which improves project climate and increases opportunities for more role expansion. A balancing loop: vetting capacity is finite; when many recognized contributors seek governance roles, maintainers slow down promotions to preserve quality, elongating time-to-candidacy. Nonlinearities arise at trust thresholds: a single breach (e.g., policy violation) can reset candidacy to zero, while a handful of crisis interventions (e.g., resolving a flameout) can accelerate candidacy sharply. Typical delays are 2–6 months of consistent governance contributions before nomination.",
        "theories_used": [
          "Adaptive Structuration Theory",
          "Stability and Change in Organizational Routines"
        ],
        "additional_theories_used": [
          {
            "theory_name": "Ostrom’s Design Principles for Governing the Commons",
            "rationale": "Models how participatory rule-making, monitoring, and enforcement sustain credible, community-based governance that shapes role expansion and candidacy."
          }
        ],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Maintainer Selection and Gatekeeping",
            "connection_type": "feeds_into",
            "description": "Maintainer Candidates are nominated or put forward for formal selection."
          },
          {
            "target_cluster": "Governance Capacity, Routine Evolution, and Project Reputation",
            "connection_type": "feedback_loop",
            "description": "Evolving routines, rule clarity, and decision transparency alter the ease of appropriating governance work and the candidacy nomination rate."
          }
        ]
      },
      {
        "name": "Maintainer Selection and Gatekeeping",
        "narrative": "Maintainer Candidates accumulate as individuals who have demonstrated sustained governance and technical reliability. They become Maintainers/Core Developers through formal or informal selection mechanisms: consensus, voting, or meritocratic appointment. Signaling remains central—reliability, responsiveness, quality of reviews, conflict resolution skill, and crisis performance act as high-credibility signals of readiness. Coevolution of New Organizational Forms and routine dynamics govern selection criteria drift: as project scale and complexity increase, coordination needs shift, and the community adjusts what it values (e.g., release engineering or security becomes more salient). Skill-Biased Technical Change raises selection thresholds as the project adopts advanced tooling or stricter security/reliability requirements, increasing time-to-selection in periods of technological shift. A reinforcing loop: more maintainers expand review and decision throughput, which improves project climate and legitimacy, attracting and retaining more contributors who become future candidates. A balancing loop: coordination and governance costs rise with team size (more meetings, more policy deliberation), causing selection rates to slow after a point. Punctuated changes occur after incidents (security breach, governance crisis) that trigger sudden tightening of criteria, temporarily lowering promotion rates. Typical delays are 1–4 months from candidacy to selection in stable periods; they lengthen during crises or rapid technological transitions.",
        "theories_used": [
          "Signaling Theory",
          "The Coevolution of New Organizational Forms",
          "Stability and Change in Organizational Routines",
          "Skill-Biased Technical Change",
          "Punctuated Equilibrium Theory in IS Research"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Maintainer Workload, Support, and Retention",
            "connection_type": "feeds_into",
            "description": "Newly selected Maintainers enter the workload-and-retention dynamics."
          }
        ]
      },
      {
        "name": "Maintainer Workload, Support, and Retention",
        "narrative": "Maintainers/Core Developers accumulate as a stock of individuals responsible for reviews, triage, releases, and governance. They transition to Sustainable Maintainers when their job demands are matched by resources and recovery. The JD-R model structures the dynamics: demands include PR/issue volume, coordination overhead, and incident load; resources include co-maintainers, reviewer pool depth, automation (CI bots, triage tools), institutional support, and psychological safety. A reinforcing loop operates when sufficient resources reduce cycle times, lowering backlog and perceived demands; this eases stress, maintains motivation, and supports mentoring, which further expands resources. A competing reinforcing loop can be negative: as backlog grows, review latency increases, creating more rework and escalations, which amplifies demands and accelerates burnout and attrition. A balancing loop appears via recruitment and role expansion feeding in from earlier processes, gradually increasing resources and reducing individual load. Nonlinearities include a burnout tipping point: beyond a demand-to-resource ratio threshold (e.g., PRs per maintainer per week), sustainable engagement drops sharply and time-to-recovery lengthens. Delays are significant—stress accumulates over months; automation investments or corporate sponsorships may require weeks to months before reducing demands. Attrition removes maintainers from the stock; return from hiatus is possible but typically slow. Sustained, predictable cadence and visible support create resilience against spikes (e.g., releases) by increasing the buffer of available resources and shared mental models.",
        "theories_used": [
          "Job Demands-Resources (JD-R) Model",
          "Routines and Transactive Memory Systems"
        ],
        "additional_theories_used": [],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Governance Capacity, Routine Evolution, and Project Reputation",
            "connection_type": "feeds_into",
            "description": "Sustainable Maintainers provide the capacity that underpins governance throughput, routine maintenance, and release cadence."
          },
          {
            "target_cluster": "Legitimate Peripheral Socialization",
            "connection_type": "feedback_loop",
            "description": "Mentoring availability and responsiveness from Sustainable Maintainers accelerates peripheral socialization."
          },
          {
            "target_cluster": "Task-Fit Onboarding and First Contribution",
            "connection_type": "feedback_loop",
            "description": "Review throughput and feedback quality from Sustainable Maintainers increase first-PR acceptance rate."
          }
        ]
      },
      {
        "name": "Governance Capacity, Routine Evolution, and Project Reputation",
        "narrative": "Sustainable Maintainers accumulate into Governance Capacity—the ability to make timely, legitimate decisions, maintain routines, and deliver releases. Governance Capacity grows with maintainer time, effective routines, and automation, and decays through coordination overhead, conflict, and attrition. From this stock, Project Reputation and Visibility accrue as the community experiences reliable releases, fair and transparent decision-making, and high code quality. SECI and dynamic knowledge creation operate as governance knowledge (how to run releases, codes of conduct) is externalized into explicit routines and documentation, then internalized by newcomers. Routine theory explains stability and drift; continuous improvement increases throughput (e.g., refining PR labels), while drift or fragmentation during stress reduces capacity. Punctuated Equilibrium appears during crises, producing step-changes: governance reforms or tooling overhauls that temporarily lower throughput but raise medium-term capacity. Panarchy locates the project within the broader OSS ecosystem: upstream changes, foundation policies, or ecosystem shocks (e.g., security incidents) cascade across scales, altering governance load and reputation. Coevolution describes mutual adaptation between project form (e.g., moving from benevolent-dictator to committee) and technological/market context. Diffusion of Innovations governs adoption of new governance practices and automation across sub-teams, with 1–3 release cycles delay. Hidden Order reflects how micro-changes (e.g., better triage heuristics) compound into reliable cadence. A reinforcing loop: higher capacity → shorter cycle times → higher reputation → larger inflow of potential contributors. A balancing loop: rising codebase and process complexity (Skill-Biased Technical Change) increases the cognitive load of governance, slowing capacity growth unless offset by automation or role specialization. Reputation decays without ongoing delivery, with a half-life of months unless refreshed by releases or public engagement.",
        "theories_used": [
          "Nonaka's SECI Model",
          "A Dynamic Theory of Organizational Knowledge Creation",
          "Stability and Change in Organizational Routines",
          "Punctuated Equilibrium Theory in IS Research",
          "Panarchy Theory",
          "The Coevolution of New Organizational Forms",
          "Diffusion of Innovations",
          "Hidden Order: How Adaptation Builds Complexity",
          "Skill-Biased Technical Change"
        ],
        "additional_theories_used": [
          {
            "theory_name": "Ostrom’s Design Principles for Governing the Commons",
            "rationale": "Explains how credible, participatory governance maintains rule legitimacy, enabling sustained capacity and reputation."
          }
        ],
        "connections_to_other_clusters": [
          {
            "target_cluster": "Attraction and Conversion to Engagement",
            "connection_type": "feedback_loop",
            "description": "Higher reputation and visible cadence increase the conversion of Prospective Observers to Engaged Newcomers."
          },
          {
            "target_cluster": "Task-Fit Onboarding and First Contribution",
            "connection_type": "feedback_loop",
            "description": "Routine clarity and automation reduce onboarding friction and review latency for first contributions."
          },
          {
            "target_cluster": "Maintainer Selection and Gatekeeping",
            "connection_type": "feedback_loop",
            "description": "Evolving governance forms and criteria adjust selection thresholds and rates for new maintainers."
          }
        ]
      }
    ],
    "overall_narrative": "The model traces a pipeline of people moving from Prospective Observers to Engaged Newcomers, Peripheral Participants, Active PR Submitters, Competent Contributors, Recognized Contributors, Maintainer Candidates, Maintainers, and Sustainable Maintainers. Each process is a SISO mini-system that transforms one stock into the next at rates shaped by learnable routines, social signals, governance rules, and resource constraints. Multiple cross-process feedbacks weave these modules into a dynamic architecture: sustainable maintainers increase review throughput and mentoring, speeding both first-PR completion and peripheral socialization; governance capacity and release cadence amplify project reputation, which increases attraction at the front of the pipeline; routine clarity and automation lower friction for onboarding; selection criteria coevolve with project complexity, modulating the gate from candidacy to maintainership. Dominant system archetypes include Limits to Growth (inflow growth constrained by review and governance capacity), Success to the Successful (recognized contributors gain visibility that accelerates promotion), Growth and Underinvestment (demand growth outpacing automation and governance investment), and Balancing with Delay (burnout and recovery lags shaping maintainer retention). Nonlinear thresholds—social proof for attraction, setup friction for first PRs, trust for recognition, and burnout tipping points—produce phase shifts and punctuations in trajectory. Governance is explicit in three places: role expansion into governance work, maintainer selection and gatekeeping, and the governance capacity module that transforms maintainer time into legitimate decisions and reliable releases. Panarchy and coevolution connect the project to the broader OSS ecosystem, enabling simulation of shocks (e.g., security incidents, upstream changes) and governance reforms. The structure is ready to be parameterized with observed rates (e.g., PR latency, release cadence, attrition) to test policies such as adding automation, diversifying entry pathways, adjusting selection criteria, or investing in mentoring to accelerate movement from periphery to core while sustaining governance quality."
  }
}