{
  "descriptions": [
    {
      "id": "C01",
      "description": "More maintainer time increases the rate at which issues can be resolved."
    },
    {
      "id": "C02",
      "description": "A higher number of open issues motivates contributors to submit more pull requests."
    },
    {
      "id": "C03",
      "description": "More open issues generate more user and contributor feedback about problems."
    },
    {
      "id": "C04",
      "description": "Feedback from users and contributors often identifies new issues or clarifies existing ones."
    },
    {
      "id": "C05",
      "description": "A larger codebase increases complexity, leading to a higher rate of issue discovery."
    },
    {
      "id": "C06",
      "description": "A larger queue of pull requests under review increases the potential merge rate."
    },
    {
      "id": "C07",
      "description": "A larger queue of pull requests under review increases the potential for rejections."
    },
    {
      "id": "C08",
      "description": "Merging pull requests adds new code and features to the source code stock."
    },
    {
      "id": "C09",
      "description": "More core developers increase the capacity for mentorship and implicit knowledge transfer."
    },
    {
      "id": "C10",
      "description": "Effective mentorship accelerates the promotion of experienced contributors to core developers."
    },
    {
      "id": "C11",
      "description": "Project's implicit knowledge depreciates as contributors leave or forget details."
    },
    {
      "id": "C12",
      "description": "Explicit knowledge is converted to implicit understanding through practice and application."
    },
    {
      "id": "C13",
      "description": "Converting explicit knowledge to implicit understanding increases the stock of implicit knowledge."
    },
    {
      "id": "C14",
      "description": "A richer searchable knowledge base directly increases the stock of explicit knowledge."
    },
    {
      "id": "C15",
      "description": "Feedback from pull request reviews is documented, enriching the searchable knowledge base."
    },
    {
      "id": "C16",
      "description": "Closed issues provide resolved examples and solutions for the searchable knowledge base."
    },
    {
      "id": "C17",
      "description": "Community discussions capture decisions and context for the searchable knowledge base."
    },
    {
      "id": "C18",
      "description": "New contributors gain skills through participation, increasing their skill-up rate."
    },
    {
      "id": "C19",
      "description": "The skill-up flow moves contributors from the new to the experienced contributor stock."
    },
    {
      "id": "C20",
      "description": "Experienced contributors are the primary pool from which promotions to core developer occur."
    },
    {
      "id": "C21",
      "description": "The promotion rate flow adds new members to the core developer stock."
    },
    {
      "id": "C22",
      "description": "The joining rate flow determines the influx of new contributors to the project."
    },
    {
      "id": "C23",
      "description": "Good documentation and guides lower the barrier to entry, increasing the joining rate."
    },
    {
      "id": "C24",
      "description": "Explicit knowledge transfer through documentation accelerates the skill-up process."
    },
    {
      "id": "C25",
      "description": "The stock of explicit knowledge is the source material for creating documentation and guides."
    },
    {
      "id": "C26",
      "description": "A larger backlog of open issues creates pressure to increase the issue resolution rate."
    },
    {
      "id": "C27",
      "description": "The issue resolution rate flow moves issues from open to the closed issues stock."
    },
    {
      "id": "C28",
      "description": "More core developers reduce the average delay for pull request reviews."
    },
    {
      "id": "C29",
      "description": "Shorter review delays enable faster and more iterative feedback on pull requests."
    },
    {
      "id": "C30",
      "description": "Timely and constructive PR feedback encourages new contributors to remain engaged."
    },
    {
      "id": "C31",
      "description": "Effective PR feedback helps experienced contributors refine their skills and contributions."
    },
    {
      "id": "C32",
      "description": "High-quality PR feedback is a core developer activity that reinforces their role."
    },
    {
      "id": "C33",
      "description": "New contributors generate PR feedback as they submit their own pull requests for review."
    },
    {
      "id": "C34",
      "description": "Experienced contributors generate PR feedback by reviewing others' pull requests."
    },
    {
      "id": "C35",
      "description": "PR feedback leads to revisions, keeping pull requests in the under-review state longer."
    },
    {
      "id": "C36",
      "description": "The adoption rate flow increases the user base as new users start using the software."
    },
    {
      "id": "C37",
      "description": "The user churn rate flow decreases the user base as users stop using the software."
    },
    {
      "id": "C38",
      "description": "Positive project outcomes and community interactions build the project's reputation."
    },
    {
      "id": "C39",
      "description": "Negative events, bugs, or community conflict cause the project's reputation to decline."
    },
    {
      "id": "C40",
      "description": "High software quality and rich features positively influence the project's reputation."
    },
    {
      "id": "C41",
      "description": "A larger user base provides social proof and visibility, enhancing project reputation."
    },
    {
      "id": "C42",
      "description": "Positive interactions and reliable collaboration build trust, improving community health."
    },
    {
      "id": "C43",
      "description": "Conflict, burnout, and toxic interactions erode the culture and health of the community."
    },
    {
      "id": "C44",
      "description": "A healthy community with good collaboration is a positive signal for project reputation."
    },
    {
      "id": "C45",
      "description": "A strong project reputation attracts more potential contributors, increasing the joining rate."
    },
    {
      "id": "C46",
      "description": "A positive project reputation makes the project more appealing to new contributors."
    }
  ]
}