{
  "descriptions": [
    {
      "id": "C01",
      "description": "More maintainer time increases the rate at which issues can be resolved."
    },
    {
      "id": "C02",
      "description": "The issue resolution rate increases the stock of closed issues."
    },
    {
      "id": "C03",
      "description": "Greater explicit knowledge enables more effective knowledge transfer through documentation."
    },
    {
      "id": "C04",
      "description": "Better documentation lowers the barrier to entry, increasing the joining rate."
    },
    {
      "id": "C05",
      "description": "Clear documentation helps contributors learn faster, accelerating their skill-up."
    },
    {
      "id": "C06",
      "description": "More feedback from the community can lead to the identification of new issues."
    },
    {
      "id": "C07",
      "description": "A high number of open issues generates more user feedback and discussion."
    },
    {
      "id": "C08",
      "description": "A higher issue creation rate directly increases the stock of open issues."
    },
    {
      "id": "C09",
      "description": "A higher issue resolution rate decreases the stock of open issues."
    },
    {
      "id": "C10",
      "description": "More open issues often inspire contributors to submit pull requests to fix them."
    },
    {
      "id": "C11",
      "description": "A higher review rate decreases the stock of new pull requests by processing them."
    },
    {
      "id": "C12",
      "description": "A higher new PR rate increases the stock of new pull requests."
    },
    {
      "id": "C13",
      "description": "New pull requests move into the 'under review' stock once work begins on them."
    },
    {
      "id": "C14",
      "description": "Providing PR feedback is a key activity that occurs on pull requests under review."
    },
    {
      "id": "C15",
      "description": "A higher rejection rate decreases the stock of pull requests under review."
    },
    {
      "id": "C16",
      "description": "Merging or committing a PR removes it from the 'under review' stock."
    },
    {
      "id": "C17",
      "description": "The code from reviewed and merged pull requests contributes to the project's source code."
    },
    {
      "id": "C18",
      "description": "More source code provides more surface area for users to discover and report issues."
    },
    {
      "id": "C19",
      "description": "More core developers reduce the average delay for pull request reviews."
    },
    {
      "id": "C20",
      "description": "Shorter review delays enable faster and more timely feedback on pull requests."
    },
    {
      "id": "C21",
      "description": "As new contributors skill up, they graduate out of the 'new contributors' stock."
    },
    {
      "id": "C22",
      "description": "A higher joining rate increases the stock of new contributors."
    },
    {
      "id": "C23",
      "description": "Receiving constructive PR feedback helps retain new contributors."
    },
    {
      "id": "C24",
      "description": "The promotion rate decreases the stock of experienced contributors as they move up."
    },
    {
      "id": "C25",
      "description": "The skill-up flow increases the stock of experienced contributors."
    },
    {
      "id": "C26",
      "description": "Positive PR feedback reinforces an experienced contributor's commitment and skills."
    },
    {
      "id": "C27",
      "description": "Consistently high-quality contributions and feedback can lead to promotion to core developer."
    },
    {
      "id": "C28",
      "description": "The promotion rate directly increases the stock of core developers."
    },
    {
      "id": "C29",
      "description": "Developer turnover decreases the stock of core developers when they leave the project."
    },
    {
      "id": "C30",
      "description": "A larger stock of implicit knowledge provides more material for mentorship."
    },
    {
      "id": "C31",
      "description": "More core developers increase the capacity for mentorship and implicit knowledge transfer."
    },
    {
      "id": "C32",
      "description": "Effective mentorship accelerates the skill-up of contributors."
    },
    {
      "id": "C33",
      "description": "Mentorship prepares contributors for greater responsibility, increasing the promotion rate."
    },
    {
      "id": "C34",
      "description": "When developers leave, their unique, tacit knowledge is lost."
    },
    {
      "id": "C35",
      "description": "The loss of knowledge through turnover depletes the project's implicit knowledge stock."
    },
    {
      "id": "C36",
      "description": "Converting explicit knowledge to implicit understanding enriches the project's implicit knowledge."
    },
    {
      "id": "C37",
      "description": "The knowledge conversion rate depletes implicit knowledge as it is formalized into explicit forms."
    },
    {
      "id": "C38",
      "description": "The knowledge conversion rate increases explicit knowledge by documenting tacit understanding."
    },
    {
      "id": "C39",
      "description": "Converting knowledge from explicit to implicit form utilizes and transforms that explicit knowledge."
    },
    {
      "id": "C40",
      "description": "A more comprehensive searchable knowledge base directly represents more explicit knowledge."
    },
    {
      "id": "C41",
      "description": "Feedback from PR reviews often contains insights that are added to the knowledge base."
    },
    {
      "id": "C42",
      "description": "Closed issues, especially their resolutions, become valuable entries in the knowledge base."
    },
    {
      "id": "C43",
      "description": "Community engagement through forums and chats generates content for the knowledge base."
    },
    {
      "id": "C44",
      "description": "Discussions often resolve problems and create documentation for the knowledge base."
    },
    {
      "id": "C45",
      "description": "The adoption rate increases the user base as new users start using the software."
    },
    {
      "id": "C46",
      "description": "User churn decreases the user base as users stop using the software."
    },
    {
      "id": "C47",
      "description": "A larger user base contributes to the project's visibility and reputation."
    },
    {
      "id": "C48",
      "description": "Reputation building through success and advocacy increases the project's reputation stock."
    },
    {
      "id": "C49",
      "description": "Reputation decline, from bugs or poor support, decreases the project's reputation."
    },
    {
      "id": "C50",
      "description": "High software quality and rich features directly enhance the project's reputation."
    },
    {
      "id": "C51",
      "description": "A healthy, vibrant community signals project stability and increases its reputation."
    },
    {
      "id": "C52",
      "description": "A large user base demonstrates popularity and validation, boosting reputation."
    },
    {
      "id": "C53",
      "description": "Trust building through positive interactions strengthens the overall health of the community."
    },
    {
      "id": "C54",
      "description": "Culture erosion from conflict or toxicity damages the health of the community."
    },
    {
      "id": "C55",
      "description": "A good project reputation attracts more potential contributors, influencing the joining rate."
    },
    {
      "id": "C56",
      "description": "Good documentation makes the project more accessible, increasing the joining rate."
    },
    {
      "id": "C57",
      "description": "A strong project reputation attracts more contributors, increasing the joining rate."
    }
  ]
}