{
  "descriptions": [
    {
      "id": "C01",
      "description": "More maintainer time increases the rate at which issues can be resolved."
    },
    {
      "id": "C02",
      "description": "A higher issue resolution rate increases the stock of closed issues."
    },
    {
      "id": "C03",
      "description": "A larger base of explicit knowledge enables more effective knowledge transfer through documentation."
    },
    {
      "id": "C04",
      "description": "Better documentation lowers the barrier to entry, increasing the potential joining rate."
    },
    {
      "id": "C05",
      "description": "Clear documentation helps contributors learn faster, increasing their skill-up rate."
    },
    {
      "id": "C06",
      "description": "A better project reputation attracts more potential contributors, increasing the joining rate."
    },
    {
      "id": "C07",
      "description": "A higher project reputation attracts more potential contributors, increasing the joining rate."
    },
    {
      "id": "C08",
      "description": "More feedback from users and developers can lead to the identification of new issues."
    },
    {
      "id": "C09",
      "description": "More open issues generate more feedback from users and contributors."
    },
    {
      "id": "C10",
      "description": "More open issues represent more work, stimulating contributors to create new pull requests."
    },
    {
      "id": "C11",
      "description": "A higher rate of new pull requests increases the stock of pull requests awaiting action."
    },
    {
      "id": "C12",
      "description": "New pull requests move into the 'under review' stock as they begin the review process."
    },
    {
      "id": "C13",
      "description": "A faster review rate decreases the stock of new pull requests awaiting initial attention."
    },
    {
      "id": "C14",
      "description": "Pull requests under review contain potential code improvements that enhance the source code's value."
    },
    {
      "id": "C15",
      "description": "Merging pull requests removes them from the 'under review' stock."
    },
    {
      "id": "C16",
      "description": "Rejecting pull requests removes them from the 'under review' stock."
    },
    {
      "id": "C17",
      "description": "Providing PR feedback is a core activity performed on pull requests under review."
    },
    {
      "id": "C18",
      "description": "A larger backlog of pull requests under review can increase the rate of rejections due to quality or relevance scrutiny."
    },
    {
      "id": "C19",
      "description": "More core developers reduce the average delay in providing pull request reviews."
    },
    {
      "id": "C20",
      "description": "Shorter review delays enable more timely and frequent feedback on pull requests."
    },
    {
      "id": "C21",
      "description": "New contributors gain experience over time, transitioning into the experienced contributors stock."
    },
    {
      "id": "C22",
      "description": "As contributors skill up, they transition out of the 'new contributors' stock."
    },
    {
      "id": "C23",
      "description": "Experienced contributors are promoted into the core developer role based on merit and involvement."
    },
    {
      "id": "C24",
      "description": "The promotion rate decreases the stock of experienced contributors as they move to core roles."
    },
    {
      "id": "C25",
      "description": "Constructive PR feedback helps experienced contributors refine their skills and understanding."
    },
    {
      "id": "C26",
      "description": "Receiving PR feedback is a primary learning mechanism for new contributors."
    },
    {
      "id": "C27",
      "description": "PR feedback helps core developers stay aligned on project standards and technical direction."
    },
    {
      "id": "C28",
      "description": "Experienced contributors provide valuable feedback due to their deeper project knowledge."
    },
    {
      "id": "C29",
      "description": "New contributors generate questions and discussions that lead to PR feedback."
    },
    {
      "id": "C30",
      "description": "PR feedback discussions are archived, contributing to the searchable knowledge base."
    },
    {
      "id": "C31",
      "description": "A larger stock of implicit knowledge is subject to greater loss through forgetting or context decay."
    },
    {
      "id": "C32",
      "description": "Higher developer turnover accelerates the loss of implicit, undocumented knowledge from the project."
    },
    {
      "id": "C33",
      "description": "Implicit knowledge held by contributors can be formalized and converted into explicit knowledge."
    },
    {
      "id": "C34",
      "description": "Converting implicit knowledge to explicit knowledge increases the stock of explicit knowledge."
    },
    {
      "id": "C35",
      "description": "Existing explicit knowledge provides a foundation for creating and converting more implicit understanding."
    },
    {
      "id": "C36",
      "description": "A rich base of implicit knowledge among core members enables more effective mentorship."
    },
    {
      "id": "C37",
      "description": "Effective mentorship directly accelerates the skill development of less experienced contributors."
    },
    {
      "id": "C38",
      "description": "Successful mentorship increases the rate at which contributors are promoted by building their competence."
    },
    {
      "id": "C39",
      "description": "More core developers increase the project's capacity for providing mentorship."
    },
    {
      "id": "C40",
      "description": "A comprehensive knowledge base directly adds to the project's stock of explicit knowledge."
    },
    {
      "id": "C41",
      "description": "Resolved issues and their solutions are documented, enriching the searchable knowledge base."
    },
    {
      "id": "C42",
      "description": "Community discussions generate insights and solutions that are added to the knowledge base."
    },
    {
      "id": "C43",
      "description": "Feedback from pull request reviews is documented and becomes part of the searchable knowledge base."
    },
    {
      "id": "C44",
      "description": "A higher issue creation rate increases the stock of open issues."
    },
    {
      "id": "C45",
      "description": "More source code provides a larger surface area for bugs and feature requests, increasing issue creation."
    },
    {
      "id": "C46",
      "description": "Resolving issues decreases the stock of open issues."
    },
    {
      "id": "C47",
      "description": "A higher adoption rate increases the size of the user base."
    },
    {
      "id": "C48",
      "description": "User churn decreases the size of the user base."
    },
    {
      "id": "C49",
      "description": "A larger user base contributes to project visibility and reputation through usage and advocacy."
    },
    {
      "id": "C50",
      "description": "Positive project activities and outcomes build up the project's reputation over time."
    },
    {
      "id": "C51",
      "description": "Negative events or poor project health cause a decline in project reputation."
    },
    {
      "id": "C52",
      "description": "High-quality software with good features enhances the project's reputation."
    },
    {
      "id": "C53",
      "description": "A large user base signals popularity and utility, bolstering the project's reputation."
    },
    {
      "id": "C54",
      "description": "A healthy, collaborative community positively reflects on and enhances the project's reputation."
    },
    {
      "id": "C55",
      "description": "Positive interactions and reliable contributions build trust, strengthening community health."
    },
    {
      "id": "C56",
      "description": "Toxic interactions and burnout erode collaborative norms, damaging community health."
    }
  ]
}